import React, { Component } from 'react';
import { compose } from 'recompose'
import { withRouter } from 'react-router-dom'

import { WorkDetailComponent } from 'Components/ourWorkSections'
import { withLang } from 'Hocs';

class WorkDetail extends Component {
  state = {
    contentLoaded: {
      mainHeader: '',
      subHeader1: '',
      subHeader2: '',
      subHeader3: '',
      content1: '',
      content2: '',
      content3: '',
      imageInfo: {
        client: '',
        service: '',
        year: '',
      },
      logoPath: ''
    }
  }

  componentWillReceiveProps({ match: { params: { id, lang } } }) {
    const tempContent = {
      mac5: {
        th: {
          mainHeader: 'เว็บไซต์ซอฟต์แวร์ ที่ทันสมัย ใช้งานได้ครบทุกฟังก์ชั่น พร้อมความสวยงาม',
          subHeader1: 'เว็บไซต์ของซอฟต์แวร์ ERP ที่เนื้อหาเยอะ จะจัดการอย่างไร?',
          subHeader2: 'ดีไซน์ที่สวยงาม ทำให้ผู้ใช้งานรู้สึกแปลกตา และประทับใจ',
          subHeader3: 'ในมือถือก็ใช้งานได้อย่างสวยงามราบรื่น',
          content1: 'เว็บไซต์ที่มีเนื้อหาค่อนข้างเยอะ และต้องการสื่อสารกับลูกค้าให้ครบถ้วน พร้อมการบริการออนไลน์ในการให้คำปรึกษาเกี่ยวกับซอฟต์แวร์ที่เข้าถึงลูกค้าได้ ทำให้เราชาวฮ็อบบิซต้องค้นหาตัวช่วยที่จะทำให้เว็บไซต์สามารถทำงานได้ในทุกส่วน หรือง่ายๆคือการค้นหา Plug-in ที่เหมาะสมในการใช้งาน เพื่อทุ่นแรงของลูกค้าในการทำงาน การจัดการเนื้อหาก็เช่นกัน เราเน้นการจัดหมวดหมู่ของเนื้อหา (Grouping) โดยดูถึงการใช้งาน และพฤติกรรมการใช้งานของลูกค้าเป็นหลัก เช่น เมนูแบบไหนที่คนนิยมกดเข้าเพื่อดูรายละเอียด หรือปุ่มแบบไหนที่ดึงดูดให้คนกดเพื่อเข้าอ่านข้อมูลมากที่สุด',
          content2: 'ปกติแล้วรูปแบบการดีไซน์เว็บไซต์ของโปรแกรมซอฟต์แวร์มักจะออกมาดูจริงจัง เป็นทางการ และเต็มไปด้วยเนื้อหา ทำให้ลูกค้าส่วนใหญ่(มักจะ)ไม่กดอ่าน และเข้ามาเพื่อมองหาแต่สิ่งที่ตนเองต้องการและจากไป เช่น ราคา หรือ ฟังก์ชั่นหลักของซอฟท์แวร์ โดยไม่ได้รู้สึกจดจำเกี่ยวกับเว็บไซต์สักเท่าไหร่นัก ฮ็อบบิซเน้นความสำคัญในการทำให้เว็บไซต์น่าใช้งาน และติดตาลูกค้าแม้ออกจากเว็บไซต์ไปแล้ว โดยการทำเว็บไซต์ MAC-5 ในครั้งนี้ เราเน้นการดึงสีที่ใช่ของ MAC-5 ออกมา พร้อมการเพิ่มลูกเล่นและเสน่ห์ ทำให้คนสนุกกับการเลื่อนเม้าส์เพื่อดูเว็บไซต์ทั้งหมด ส่งผลต่อคะแนนของเว็บไซต์ และส่งผลต่อการทำการตลาดออนไลน์ด้วย',
          content3: 'อย่างที่กล่าวข้างต้นว่าเว็บไซต์ MAC-5 นั้น เน้นการให้บริการที่เข้าถึงลูกค้าทุกคน ทำให้แม้กระทั่งในมือถือลูกค้าก็สามารถจองคอร์สอบรมออนไลน์ได้ทันที และทันใจ พร้อมใช้งานฟังก์ชั่นอื่นๆ ทั้งการให้คำปรึกษา และการพูดคุยออนไลน์ได้อย่างรวดเร็วอีกเช่นกัน เพิ่มประสิทธิภาพในการมีเว็บไซต์มากขึ้นได้อย่างที่ฮ็อบบิซตั้งใจไว้ ว่าเว็บไซต์บริษัทนั้นแสดงถึงวัฒนธรรมองค์กรณ์ และการมีเว็บไซต์ที่ดีนั้นเพิ่มมูลค่าให้กับแบรนด์อย่างแท้จริง',
          imageInfo: {
            client: 'Mac-5',
            service: 'เว็บไซต์',
            year: '2017',
          },
          logoPath: 'mac.png'
        },
        en: {
          mainHeader: 'เว็บไซต์ซอฟต์แวร์ ที่ทันสมัย ใช้งานได้ครบทุกฟังก์ชั่น พร้อมความสวยงาม',
          subHeader1: 'เว็บไซต์ของซอฟต์แวร์ ERP ที่เนื้อหาเยอะ จะจัดการอย่างไร?',
          subHeader2: 'ดีไซน์ที่สวยงาม ทำให้ผู้ใช้งานรู้สึกแปลกตา และประทับใจ',
          subHeader3: 'ในมือถือก็ใช้งานได้อย่างสวยงามราบรื่น',
          content1: 'เว็บไซต์ที่มีเนื้อหาค่อนข้างเยอะ และต้องการสื่อสารกับลูกค้าให้ครบถ้วน พร้อมการบริการออนไลน์ในการให้คำปรึกษาเกี่ยวกับซอฟต์แวร์ที่เข้าถึงลูกค้าได้ ทำให้เราชาวฮ็อบบิซต้องค้นหาตัวช่วยที่จะทำให้เว็บไซต์สามารถทำงานได้ในทุกส่วน หรือง่ายๆคือการค้นหา Plug-in ที่เหมาะสมในการใช้งาน เพื่อทุ่นแรงของลูกค้าในการทำงาน การจัดการเนื้อหาก็เช่นกัน เราเน้นการจัดหมวดหมู่ของเนื้อหา (Grouping) โดยดูถึงการใช้งาน และพฤติกรรมการใช้งานของลูกค้าเป็นหลัก เช่น เมนูแบบไหนที่คนนิยมกดเข้าเพื่อดูรายละเอียด หรือปุ่มแบบไหนที่ดึงดูดให้คนกดเพื่อเข้าอ่านข้อมูลมากที่สุด',
          content2: 'ปกติแล้วรูปแบบการดีไซน์เว็บไซต์ของโปรแกรมซอฟต์แวร์มักจะออกมาดูจริงจัง เป็นทางการ และเต็มไปด้วยเนื้อหา ทำให้ลูกค้าส่วนใหญ่(มักจะ)ไม่กดอ่าน และเข้ามาเพื่อมองหาแต่สิ่งที่ตนเองต้องการและจากไป เช่น ราคา หรือ ฟังก์ชั่นหลักของซอฟท์แวร์ โดยไม่ได้รู้สึกจดจำเกี่ยวกับเว็บไซต์สักเท่าไหร่นัก ฮ็อบบิซเน้นความสำคัญในการทำให้เว็บไซต์น่าใช้งาน และติดตาลูกค้าแม้ออกจากเว็บไซต์ไปแล้ว โดยการทำเว็บไซต์ MAC-5 ในครั้งนี้ เราเน้นการดึงสีที่ใช่ของ MAC-5 ออกมา พร้อมการเพิ่มลูกเล่นและเสน่ห์ ทำให้คนสนุกกับการเลื่อนเม้าส์เพื่อดูเว็บไซต์ทั้งหมด ส่งผลต่อคะแนนของเว็บไซต์ และส่งผลต่อการทำการตลาดออนไลน์ด้วย',
          content3: 'อย่างที่กล่าวข้างต้นว่าเว็บไซต์ MAC-5 นั้น เน้นการให้บริการที่เข้าถึงลูกค้าทุกคน ทำให้แม้กระทั่งในมือถือลูกค้าก็สามารถจองคอร์สอบรมออนไลน์ได้ทันที และทันใจ พร้อมใช้งานฟังก์ชั่นอื่นๆ ทั้งการให้คำปรึกษา และการพูดคุยออนไลน์ได้อย่างรวดเร็วอีกเช่นกัน เพิ่มประสิทธิภาพในการมีเว็บไซต์มากขึ้นได้อย่างที่ฮ็อบบิซตั้งใจไว้ ว่าเว็บไซต์บริษัทนั้นแสดงถึงวัฒนธรรมองค์กรณ์ และการมีเว็บไซต์ที่ดีนั้นเพิ่มมูลค่าให้กับแบรนด์อย่างแท้จริง',
          imageInfo: {
            client: 'Mac-5',
            service: 'เว็บไซต์',
            year: '2017',
          },
          logoPath: 'mac.png'
        },
      },
      asap: {
        th: {
          mainHeader: 'เอแซป',
          subHeader1: 'เว็บไซต์ของซอฟต์แวร์ ERP ที่เนื้อหาเยอะ จะจัดการอย่างไร?',
          subHeader2: 'ดีไซน์ที่สวยงาม ทำให้ผู้ใช้งานรู้สึกแปลกตา และประทับใจ',
          subHeader3: 'ในมือถือก็ใช้งานได้อย่างสวยงามราบรื่น',
          content1: 'เว็บไซต์ที่มีเนื้อหาค่อนข้างเยอะ และต้องการสื่อสารกับลูกค้าให้ครบถ้วน พร้อมการบริการออนไลน์ในการให้คำปรึกษาเกี่ยวกับซอฟต์แวร์ที่เข้าถึงลูกค้าได้ ทำให้เราชาวฮ็อบบิซต้องค้นหาตัวช่วยที่จะทำให้เว็บไซต์สามารถทำงานได้ในทุกส่วน หรือง่ายๆคือการค้นหา Plug-in ที่เหมาะสมในการใช้งาน เพื่อทุ่นแรงของลูกค้าในการทำงาน การจัดการเนื้อหาก็เช่นกัน เราเน้นการจัดหมวดหมู่ของเนื้อหา (Grouping) โดยดูถึงการใช้งาน และพฤติกรรมการใช้งานของลูกค้าเป็นหลัก เช่น เมนูแบบไหนที่คนนิยมกดเข้าเพื่อดูรายละเอียด หรือปุ่มแบบไหนที่ดึงดูดให้คนกดเพื่อเข้าอ่านข้อมูลมากที่สุด',
          content2: 'ปกติแล้วรูปแบบการดีไซน์เว็บไซต์ของโปรแกรมซอฟต์แวร์มักจะออกมาดูจริงจัง เป็นทางการ และเต็มไปด้วยเนื้อหา ทำให้ลูกค้าส่วนใหญ่(มักจะ)ไม่กดอ่าน และเข้ามาเพื่อมองหาแต่สิ่งที่ตนเองต้องการและจากไป เช่น ราคา หรือ ฟังก์ชั่นหลักของซอฟท์แวร์ โดยไม่ได้รู้สึกจดจำเกี่ยวกับเว็บไซต์สักเท่าไหร่นัก ฮ็อบบิซเน้นความสำคัญในการทำให้เว็บไซต์น่าใช้งาน และติดตาลูกค้าแม้ออกจากเว็บไซต์ไปแล้ว โดยการทำเว็บไซต์ MAC-5 ในครั้งนี้ เราเน้นการดึงสีที่ใช่ของ MAC-5 ออกมา พร้อมการเพิ่มลูกเล่นและเสน่ห์ ทำให้คนสนุกกับการเลื่อนเม้าส์เพื่อดูเว็บไซต์ทั้งหมด ส่งผลต่อคะแนนของเว็บไซต์ และส่งผลต่อการทำการตลาดออนไลน์ด้วย',
          content3: 'อย่างที่กล่าวข้างต้นว่าเว็บไซต์ MAC-5 นั้น เน้นการให้บริการที่เข้าถึงลูกค้าทุกคน ทำให้แม้กระทั่งในมือถือลูกค้าก็สามารถจองคอร์สอบรมออนไลน์ได้ทันที และทันใจ พร้อมใช้งานฟังก์ชั่นอื่นๆ ทั้งการให้คำปรึกษา และการพูดคุยออนไลน์ได้อย่างรวดเร็วอีกเช่นกัน เพิ่มประสิทธิภาพในการมีเว็บไซต์มากขึ้นได้อย่างที่ฮ็อบบิซตั้งใจไว้ ว่าเว็บไซต์บริษัทนั้นแสดงถึงวัฒนธรรมองค์กรณ์ และการมีเว็บไซต์ที่ดีนั้นเพิ่มมูลค่าให้กับแบรนด์อย่างแท้จริง',
          imageInfo: {
            client: 'Mac-5',
            service: 'เว็บไซต์',
            year: '2017',
          },
          logoPath: 'mac.png'
        },
        en: {
          mainHeader: 'asap',
          subHeader1: 'เว็บไซต์ของซอฟต์แวร์ ERP ที่เนื้อหาเยอะ จะจัดการอย่างไร?',
          subHeader2: 'ดีไซน์ที่สวยงาม ทำให้ผู้ใช้งานรู้สึกแปลกตา และประทับใจ',
          subHeader3: 'ในมือถือก็ใช้งานได้อย่างสวยงามราบรื่น',
          content1: 'เว็บไซต์ที่มีเนื้อหาค่อนข้างเยอะ และต้องการสื่อสารกับลูกค้าให้ครบถ้วน พร้อมการบริการออนไลน์ในการให้คำปรึกษาเกี่ยวกับซอฟต์แวร์ที่เข้าถึงลูกค้าได้ ทำให้เราชาวฮ็อบบิซต้องค้นหาตัวช่วยที่จะทำให้เว็บไซต์สามารถทำงานได้ในทุกส่วน หรือง่ายๆคือการค้นหา Plug-in ที่เหมาะสมในการใช้งาน เพื่อทุ่นแรงของลูกค้าในการทำงาน การจัดการเนื้อหาก็เช่นกัน เราเน้นการจัดหมวดหมู่ของเนื้อหา (Grouping) โดยดูถึงการใช้งาน และพฤติกรรมการใช้งานของลูกค้าเป็นหลัก เช่น เมนูแบบไหนที่คนนิยมกดเข้าเพื่อดูรายละเอียด หรือปุ่มแบบไหนที่ดึงดูดให้คนกดเพื่อเข้าอ่านข้อมูลมากที่สุด',
          content2: 'ปกติแล้วรูปแบบการดีไซน์เว็บไซต์ของโปรแกรมซอฟต์แวร์มักจะออกมาดูจริงจัง เป็นทางการ และเต็มไปด้วยเนื้อหา ทำให้ลูกค้าส่วนใหญ่(มักจะ)ไม่กดอ่าน และเข้ามาเพื่อมองหาแต่สิ่งที่ตนเองต้องการและจากไป เช่น ราคา หรือ ฟังก์ชั่นหลักของซอฟท์แวร์ โดยไม่ได้รู้สึกจดจำเกี่ยวกับเว็บไซต์สักเท่าไหร่นัก ฮ็อบบิซเน้นความสำคัญในการทำให้เว็บไซต์น่าใช้งาน และติดตาลูกค้าแม้ออกจากเว็บไซต์ไปแล้ว โดยการทำเว็บไซต์ MAC-5 ในครั้งนี้ เราเน้นการดึงสีที่ใช่ของ MAC-5 ออกมา พร้อมการเพิ่มลูกเล่นและเสน่ห์ ทำให้คนสนุกกับการเลื่อนเม้าส์เพื่อดูเว็บไซต์ทั้งหมด ส่งผลต่อคะแนนของเว็บไซต์ และส่งผลต่อการทำการตลาดออนไลน์ด้วย',
          content3: 'อย่างที่กล่าวข้างต้นว่าเว็บไซต์ MAC-5 นั้น เน้นการให้บริการที่เข้าถึงลูกค้าทุกคน ทำให้แม้กระทั่งในมือถือลูกค้าก็สามารถจองคอร์สอบรมออนไลน์ได้ทันที และทันใจ พร้อมใช้งานฟังก์ชั่นอื่นๆ ทั้งการให้คำปรึกษา และการพูดคุยออนไลน์ได้อย่างรวดเร็วอีกเช่นกัน เพิ่มประสิทธิภาพในการมีเว็บไซต์มากขึ้นได้อย่างที่ฮ็อบบิซตั้งใจไว้ ว่าเว็บไซต์บริษัทนั้นแสดงถึงวัฒนธรรมองค์กรณ์ และการมีเว็บไซต์ที่ดีนั้นเพิ่มมูลค่าให้กับแบรนด์อย่างแท้จริง',
          imageInfo: {
            client: 'Mac-5',
            service: 'เว็บไซต์',
            year: '2017',
          },
          logoPath: 'mac.png'
        },
      }
    }

    this.setState({ 
      contentLoaded: tempContent[id][lang],
    }) 
  }

  render() {
    const { lang } = this.props;
    const { contentLoaded } = this.state;

    return (
      <WorkDetailComponent lang={lang} contentLoaded={contentLoaded} />
    );
  }
}

const enhance = compose(
  withRouter,
  withLang('ourWorks/WorkDetail')
);

export default enhance(WorkDetail);

