module.exports = {
  "HelloFriend": {
    "header": "ยินดีที่ได้รู้จัก!",
    "title1": "กลุ่มคนที่มีความชอบในเรื่องดีไซน์ที่ซึมลึกลงจน เป็นส่วนหนึ่งในชีวิตประจำวัน",
    "title2": "เพิ่มมูลค่าด้วยการดีไซน์ สร้างสิ่งใหม่ด้วยไอเดีย พร้อมการใช้งานง่ายขึ้นและสวยงาม",
    "subtitle1":"ฮ็อบบิซเป็นบ้านที่รวบรวมคนตัวเล็กๆที่มีความรัก และความชอบในการดีไซน์ ตั้งแต่เว็บไซต์ และพัฒนาเว็บไซต์ โดยทุกคนมีสิ่งที่เหมือนกันคือเป็นคนชอบทำงาน ชอบความสนุกสนาน ชอบความเป็นระเบียบเรียบร้อยและชอบความสมบูรณ์แบบ",
    "subtitle2":"ทำให้ทุกอย่างที่ส่งต่อไปจนถึงมือของผู้ใช้งานจริงนั้นต้องเป็นของที่ดีสุด ใช้งานได้จริง และเหมาะสมกับกลุ่มผู้ใช้โดยยังคงคอนเซ็ปต์และผสมผสานไอเดียหลักของโปรเจ็คต์ไว้ได้อย่างลงตัว"
  }
}