module.exports = {
  "OurMom": {
    "header": "คุณแม่ของเราบอกว่าเราเก่งที่สุด",
    "groupTitle":{
      "text1":"ดีไซน์สดใหม่",
      "text2":"กับ",
      "text3":"โค้ดที่อ่านง่าย"
    },
    "subtitle1": "ฮ็อบบิซอยากแนะนำสิ่งที่ดีที่สุดให้กับลูกค้า และแบ่งปันประสบการณ์ทางด้านการออกแบบที่เรามีให้แก่ลูกค้า ",
    "subtitle2":"หากคุณกำลังมองหาบริษัทออกแบบที่เป็นเหมือนเพื่อนคู่คิด ที่พร้อมจะให้คำปรึกษา และคำแนะนำในด้านต่างๆไปพร้อมๆกัน  เรา “ฮ็อบบิซ” พร้อมที่จะเป็นผู้ช่วยทางด้านการออกแบบให้แก่คุณ",
    "button":"งานของเรา"
  }
}
